app/Controllers/Home.php

    public function index()
    {
        $data['productRecord'] = $this->productList->findAll();
---
SELECT *
FROM `product`

    public function addToCart($id){
        // echo $id;
        if (session()->get('item') != '') {
            $this->cart =   session()->get('item');

        }

        $record =$this->productList->find($id);
---
SELECT *
FROM `product`
WHERE `product`.`id` = '1'