app/Models/PaymentDetailModel.php

INSERT INTO `payment` (`status`, `method`, `transaction_id`, `customer_id`) VALUES ('complete', 'card', 'cs_test_a1MW7pmjJeFrfRz66fwxbPbM2sMzDdxVqp6vT0jrSRlOGogEmAN5EbJ6Up', 8)
---
    public function insertPaymentDetail($data)
    {
        // Insert payment detail into the database
        $this->insert($data);